Revit 2027 API
GlobalParametersManager.FindByName Method
 Finds whether a global parameter with the given name exists in the input document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId FindByName(
	Document document,
	string name
)
Public Shared Function FindByName (
	document As Document,
	name As String
) As ElementId
public:
static ElementId^ FindByName(
	Document^ document,
	String^ name
)
static member FindByName :
        document : Document *
        name : string -> ElementId
Parameters
document Document
 The document expected to contain the global parameter.
name String
 Name of the global parameter
Return Value
ElementId
 ElementId of the parameter element, or InvalidElementId if it was not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 No exception is thrown when no parameter with such a name exists in the document; instead, the method returns an ElementId.InvalidElementId.
Example
/// <summary>
/// Tries to find a global parameter by its name.
/// </summary>
/// <param name="document">Revit project document.</param>
/// <param name="name">Name of a global parameter.</param>
/// <returns>An Element Id of the global parameter, or InvalidElementId if none found</returns>
public ElementId GetGlobalParameterByName(Document document, String name)
{
    // Global parameters are not available in all documents.
    // They are available in projects, but not in families.
    if (GlobalParametersManager.AreGlobalParametersAllowed(document))
    {
        return GlobalParametersManager.FindByName(document, name);
    }
    // return an empty set if global parameters are not available in the document
    return ElementId.InvalidElementId;
}
See Also
Reference
GlobalParametersManager Class
Autodesk.Revit.DB Namespace